In [41]:
import numpy as np
import pandas as pd

In [42]:
train = pd.read_csv('titanic_x_y_train.csv')
test = pd.read_csv('titanic_x_test.csv')

In [43]:
train.head(3)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.00,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.05,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.00,NaN,S,0

In [44]:
test.head(3)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S
2,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q

In [45]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 668 entries, 0 to 667
Data columns (total 11 columns):
Pclass      668 non-null int64
Name        668 non-null object
Sex         668 non-null object
Age         536 non-null float64
SibSp       668 non-null int64
Parch       668 non-null int64
Ticket      668 non-null object
Fare        668 non-null float64
Cabin       154 non-null object
Embarked    667 non-null object
Survived    668 non-null int64
dtypes: float64(2), int64(4), object(5)
memory usage: 57.5+ KB

In [46]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 223 entries, 0 to 222
Data columns (total 10 columns):
Pclass      223 non-null int64
Name        223 non-null object
Sex         223 non-null object
Age         178 non-null float64
SibSp       223 non-null int64
Parch       223 non-null int64
Ticket      223 non-null object
Fare        223 non-null float64
Cabin       50 non-null object
Embarked    222 non-null object
dtypes: float64(2), int64(3), object(5)
memory usage: 17.5+ KB

In [47]:
train.shape, test.shape

((668, 11), (223, 10))

In [48]:
train.describe()

           Pclass         Age       SibSp       Parch        Fare    Survived
count  668.000000  536.000000  668.000000  668.000000  668.000000  668.000000
mean     2.296407   29.700560    0.528443    0.407186   32.064552    0.402695
std      0.831638   14.240257    1.080327    0.854695   45.320835    0.490808
min      1.000000    0.670000    0.000000    0.000000    0.000000    0.000000
25%      2.000000   21.000000    0.000000    0.000000    7.925000    0.000000
50%      3.000000   29.000000    0.000000    0.000000   14.750000    0.000000
75%      3.000000   38.250000    1.000000    0.000000   31.275000    1.000000
max      3.000000   80.000000    8.000000    6.000000  512.329200    1.000000

In [49]:
def mean_age_finder(cols):
    Age = cols[0]
    Pclass = cols[1]
    
    if pd.isnull(Age):
        if Pclass == 1:
            return 37
        elif Pclass == 2:
            return 29
        else:
            return 24
    else:
        return Age
    
    
train['Age'] = train[['Age', 'Pclass']].apply(mean_age_finder, axis = 1)
most_frequent_embarked = train['Embarked'].value_counts().index[0]      #Output: 'S'
train['Embarked'].fillna(most_frequent_embarked, inplace = True)
train.drop('Cabin', axis = 1, inplace = True)
train.isnull().sum()

Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Embarked    0
Survived    0
dtype: int64

In [50]:
test['Age'] = test[['Age', 'Pclass']].apply(mean_age_finder, axis = 1)
most_frequent_embarked = test['Embarked'].value_counts().index[0]      #Output: 'S'
test['Embarked'].fillna(most_frequent_embarked, inplace = True)
test.drop('Cabin', axis = 1, inplace = True)
test.isnull().sum()

Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Embarked    0
dtype: int64

In [51]:
sex = pd.get_dummies(train['Sex'], drop_first = True)
embarked = pd.get_dummies(train['Embarked'], drop_first = True)
train.drop(['Name', 'Sex', 'Ticket', 'Embarked'], axis = 1, inplace = True)
train = pd.concat([train, sex, embarked], axis = 1)
train.head()

   Pclass   Age  SibSp  Parch    Fare  Survived  male  Q  S
0       2  29.0      1      0  26.000         1     0  0  1
1       3  24.0      0      0   8.050         0     1  0  1
2       2  39.0      0      0  26.000         0     1  0  1
3       3  29.0      0      4  21.075         0     0  0  1
4       3  25.0      0      0   7.050         0     1  0  1

In [54]:
sex = pd.get_dummies(test['Sex'], drop_first = True)
embarked = pd.get_dummies(test['Embarked'], drop_first = True)
test.drop(['Name', 'Sex', 'Ticket', 'Embarked'], axis = 1, inplace = True)
test = pd.concat([test, sex, embarked], axis = 1)
test.head()

   Pclass   Age  SibSp  Parch     Fare  male  Q  S
0       2   8.0      1      1  36.7500     1  0  1
1       1  49.0      0      0  25.9292     0  0  1
2       3  24.0      0      0   7.7375     1  1  0
3       2  24.0      2      1  27.0000     0  0  1
4       1  36.0      0      0  26.2875     1  0  1

In [55]:
X_train = train.drop(['Survived'], axis = 1)
y_train = train['Survived']
X_test = test.copy()

X_train.shape, y_train.shape, X_test.shape

((668, 8), (668,), (223, 8))

In [56]:
from sklearn.linear_model import LogisticRegression

logmodel = LogisticRegression(solver = 'liblinear')
logmodel.fit(X_train, y_train)

log_predictions = logmodel.predict(X_test)
accuracy = round(logmodel.score(X_train, y_train) * 100, 2)
print('Logistic Regression Accuracy: ', accuracy)

Logistic Regression Accuracy:  79.49

In [57]:
np.savetxt("predictions_lr.csv", log_predictions, delimiter=",")